programming/20220606215451-nim.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-12 Wed 22:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Nim</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/org.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
  <div class="navbar-mode-line">
    <a href="/" class="navbar-circle">◉</a>
    <a href="/programming" class="navbar-filename">Programming</a>
    <a href="/hacking" class="navbar-filename">Hacking</a>
    <a href="/Tutorial" class="navbar-filename">Tutorials</a>
    <a href="/posts.html" class="navbar-filename">All Posts</a>
    <a href="/rss.xml" class="navbar-filename">Rss Feed</a>
  </div>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Nim</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org18fd3be">About</a>
<ul>
<li><a href="#org494148e">Features</a></li>
</ul>
</li>
<li><a href="#org8e7294e">Notes</a></li>
</ul>
</div>
</div>

<div id="outline-container-org18fd3be" class="outline-2">
<h2 id="org18fd3be">About</h2>
<div class="outline-text-2" id="text-org18fd3be">
<p>
Nim is a staticly typed compiled systems language.
It takes inspiration from python, ada and others.
</p>
</div>

<div id="outline-container-org494148e" class="outline-3">
<h3 id="org494148e">Features</h3>
<div class="outline-text-3" id="text-org494148e">
<p>
Taken from <a href="https://nim-lang.org/">https://nim-lang.org/</a>
</p>
<ul class="org-ul">
<li>Nim generates native dependency-free executables, not dependent on a virtual machine, which are small and allow easy redistribution.</li>

<li>The Nim compiler and the generated executables support all major platforms like Windows, Linux, BSD and macOS.</li>

<li>Nim's memory management is deterministic and customizable with destructors and move semantics, inspired by C++ and Rust. It is well-suited for embedded, hard-realtime systems.</li>

<li>Modern concepts like zero-overhead iterators and compile-time evaluation of user-defined functions, in combination with the preference of value-based datatypes allocated on the stack, lead to extremely performant code.</li>

<li>Support for various backends: it compiles to C, C++ or JavaScript so that Nim can be used for all backend and frontend needs.</li>

<li>Nim is self-contained: the compiler and the standard library are implemented in Nim.</li>

<li>Nim has a powerful macro system which allows direct manipulation of the AST, offering nearly unlimited opportunities.</li>

<li>Macros cannot change Nim's syntax because there is no need for it — the syntax is flexible enough.</li>

<li>Modern type system with local type inference, tuples, generics and sum types.</li>

<li>Statements are grouped by indentation but can span multiple lines.</li>

<li>Genarics</li>
</ul>
</div>
</div>
</div>



<div id="outline-container-org8e7294e" class="outline-2">
<h2 id="org8e7294e">Notes</h2>
<div class="outline-text-2" id="text-org8e7294e">
<ul class="org-ul">
<li><a href="2022-08-26-155254-metaprogramming.html#ID-982f9f57-4b5d-44b7-bc9b-89b7d977a077">Metaprogramming</a></li>
<li><a href="20230309222949-nim_android.html#ID-8a01ff13-6724-4634-b901-074187c32a85">nim android</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:unseen@flake">unseen@flake</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</p>
<p class="validation"></p>
</div>
</body>
</html>
